pages-html/labs.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en-us">

<head>
<title>Labs</title>
<!-- 2017-05-18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gonzalo Peraza" />
<link href="http://gmpg.org/xfn/11" rel="profile">

<!-- CSS -->
<link rel="stylesheet" href="../pages-html/public/css/poole.css">
<link rel="stylesheet" href="../pages-html/public/css/syntax.css">
<link rel="stylesheet" href="../pages-html/public/css/hyde.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface">

<!-- Icons -->
<link rel="apple-touch-icon" href="../pages-html/public/UPY-favicon.png">
<link rel="shortcut icon" href="../pages-html/public/favicon.ico">
<!-- Enable responsiveness on mobile devices-->
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1">
</head>
<body class="theme-base-upy">
<div id="preamble" class="sidebar">
<div class="container sidebar-sticky">
<div class="sidebar-about">
<h1>
<a href="../index.html"> Probability & Statistics  </a>
</h1>
<p class="lead">A UPY Course</p>
</div>

<nav class="sidebar-nav">
<a class="sidebar-nav-item" href="../index.html">Home</a>
<a class="sidebar-nav-item" href="syllabus.html">Syllabus</a>
<a class="sidebar-nav-item" href="lectures.html">Lectures</a>
<a class="sidebar-nav-item" href="homework.html">Homework</a>
<a class="sidebar-nav-item active" href="labs.html">Labs</a>
<a class="sidebar-nav-item" href="grades.html">Grades</a>
<a class="sidebar-nav-item" href="https://github.com/gperaza/prob-stats-upy-2017">Github repo</a>
<span class="sidebar-nav-item">May-June 2017</span>
</nav>

<p>&copy; Gonzalo Peraza. 2017-05-18</p>
</div>
</div>
<div class="content container">
<div class="page"><h1 class="page-title">Labs</h1>
<p>
During the course we are going to learn basic data analysis with the R
programming language. There exist several interfaces for working with R, we are
going to work with the provided Jupyter notebooks below. Computers at UPY <del>have
everything already set up</del> will hopefully have everything setup soon, if you
want to practice at home be sure to install both Jupyter Notebook and R. To
download the notebooks follow the link and find the download button at the top
of the page; or clone the github repository.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><a href="http://nbviewer.jupyter.org/github/gperaza/prob-stats-upy-2017/blob/master/labs/01-Introduction_to_R_and_Jupyter.ipynb#">01. Introduction to R and Jupyter</a></td>
</tr>

<tr>
<td class="left"><a href="http://nbviewer.jupyter.org/github/gperaza/prob-stats-upy-2017/blob/master/labs/02-Introduction_to_data.ipynb#">02. Introduction to data</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Installing Jupyter and R</h2>
<div class="outline-text-2" id="text-1">
<p>
The easier way to install both Jupyter and R with the interface between them
configured automatically is to install first the Anaconda Python
distribution. After you have Anaconda installed do the following:
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Windows</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Open the program called "anaconda prompt" and input the following command:
</p>
<div class="org-src-container">

<pre class="src src-sh">conda install -c r r-essentials
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Linux and Mac</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Run the following command in the terminal
</p>
<div class="org-src-container">

<pre class="src src-sh">conda install -c r r-essentials
</pre>
</div>
</div>
</div>
</div>
</div>
</div></body>
</html>
